import { getUserName } from "../services/getUserName.ts";
import { menuKeyboard } from "../keyboards/menuKeyboard.ts";

export async function sendWelcome(ctx: any) {
  const userName = await getUserName(ctx);
  const menuButtons = await menuKeyboard();
  console.log(ctx.user);

  await ctx.reply(
    `<h1>👋 Здравствуйте, ${userName}.</h1>
    <p>
      🤖 Я бот-помощник Иркутской области по вопросам военной службы по контракту в зоне СВО.
    </p>
    <p>
      📋 <b>С моей помощью можно:</b>
      • подать заявку на службу по контракту;
      • узнать о мерах поддержки для военнослужащих и членов их семей, ветеранов боевых действий;
      • узнать о содействии в трудоустройстве;
      • узнать ответы на часто задаваемые вопросы.
    </p>
    <p>
      📄 <b>Список команд бота:</b>
      /start — Вы перезапустите бота, начнете беседу с «чистого листа».
    </p>`,
    { format: "html" },
  );

  await ctx.reply("🗃️ Выберите интересующий раздел:", {
    format: "html",
    attachments: [menuButtons],
  });
}
