import { getUserName } from "../services/getUserName.ts";
import { mainKeyboard } from "../keyboards/mainKeyboard.ts";

export async function welcomeAction(ctx: any) {
  const userName = await getUserName(ctx);
  const mainButtons = await mainKeyboard();

  await ctx.reply(
    `<h1>👋 Здравствуйте, ${userName}.</h1>\n\n🤖 Я бот-помощник по вопросам военной службы по контракту в Иркутской области.\n\n📋 С моей помощью можно:\n• подать заявку на службу по контракту;\n• узнать о мерах поддержки для военнослужащих и членов их семей, ветеранов боевых действий;\n• узнать о содействии в трудоустройстве;\n• узнать ответы на часто задаваемые вопросы.\n\n📄 Список команд бота:\n/start — Вы перезапустите бота, начнете беседу с «чистого листа».`,
    { format: "html" },
  );

  await ctx.reply("🗃️ Выберите интересующий раздел:", {
    format: "html",
    attachments: [mainButtons],
  });
}
